{"class_name": "Sequential", "backend": "tensorflow", "config": {"layers": [{"class_name": "Flatten", "config": {"batch_input_shape": [null, 28, 28], "trainable": true, "dtype": "float32", "name": "flatten_1", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"units": 50, "activity_regularizer": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "kernel_regularizer": null, "bias_regularizer": null, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "trainable": true, "use_bias": true, "bias_constraint": null}}, {"class_name": "Dense", "config": {"units": 50, "activity_regularizer": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "kernel_regularizer": null, "bias_regularizer": null, "name": "dense_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "trainable": true, "use_bias": true, "bias_constraint": null}}, {"class_name": "Dense", "config": {"units": 1, "activity_regularizer": null, "activation": "sigmoid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "kernel_regularizer": null, "bias_regularizer": null, "name": "dense_3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "trainable": true, "use_bias": true, "bias_constraint": null}}], "name": "sequential_1"}, "keras_version": "2.2.3"}